docs/unmediated.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-04 Wed 19:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Modeling uncorrelated, unmediated effects</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Abhishek Sarkar" />
</head>
<body>
<div id="content">
<h1 class="title">Modeling uncorrelated, unmediated effects</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org96b0cd6">1. Introduction</a></li>
<li><a href="#org3b0cbe1">2. Simulation setup</a></li>
<li><a href="#orgd1efcf2">3. Joint model</a></li>
<li><a href="#orga28bc1b">4. Variational approximation</a></li>
<li><a href="#org95dff5e">5. Model fitting</a></li>
<li><a href="#orgfe7120d">6. Model evaluation</a></li>
<li><a href="#org958b2bb">7. Conclusions</a></li>
</ul>
</div>
</div>

<div id="outline-container-org96b0cd6" class="outline-2">
<h2 id="org96b0cd6"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Suppose we generate phenotypes from both mediated and unmediated effects:
</p>

<p>
\[ y^1 = x^1 w v + x^1 u + e \]
</p>

<p>
If we jointly fit mediated and unmediated effects in the model, will
uncorrelated, unmediated effects explain away the true mediated effects?
</p>

<p>
We hypothesize that requiring \(w\) to also explain the gene expression
observations will allow us to accurately estimate \(v\) even when \(u\) is
correlated with \(v\). In this case, \(w\) and \(v\) cannot co-adapt
arbitrarily.
</p>
</div>
</div>

<div id="outline-container-org3b0cbe1" class="outline-2">
<h2 id="org3b0cbe1"><span class="section-number-2">2</span> Simulation setup</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Generate random genotypes in linkage equilibrium</li>

<li>Generate Gaussian gene expression from a linear model (PVE = 0.5)</li>
</ul>

<div class="LaTeX">
<p>
\[ w_j \mid \text{causal} ~ N(0, 1) \]
\[ g^0_{ik} \mid \text{causal} ~ x^0 w + e \]
</p>

</div>

<ul class="org-ul">
<li>Generate non-causal gene expression by sampling from a Gaussian with scale
equal to the simulated expression phenotypic variance.</li>
</ul>

<p>
\[ g_{ik} \mid \text{not causal} ~ N(0, V[g \mid \causal]) \]
</p>

<ul class="org-ul">
<li>Generate GWAS genotypes and expression from the same linear model</li>
</ul>

<p>
\[ g^1_{ik} \mid \text{causal} ~ x^1 w + e \]
</p>

<ul class="org-ul">
<li>Generate uncorrelated, unmediated effects</li>
</ul>

<p>
\[ u \mid \text{causal, not eQTL} = N(0, 1) \]
</p>

<ul class="org-ul">
<li>Generate Gaussian phenotypes by adding noise to get the desired PVE.</li>
</ul>

<p>
\[ y^1 \mid N(g^1 v + x^1 u, \sigma^2) \]
</p>
</div>
</div>

<div id="outline-container-orgd1efcf2" class="outline-2">
<h2 id="orgd1efcf2"><span class="section-number-2">3</span> Joint model</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre><code class="src src-python">ed.set_seed(0)

<span style="color: #00ffff; font-style: italic;"># </span><span style="color: #00ffff; font-style: italic;">Data</span>
<span style="color: #0000ee;">x0</span> = tf.placeholder(tf.float32)
<span style="color: #0000ee;">x1</span> = tf.placeholder(tf.float32)

<span style="color: #00ffff; font-style: italic;"># </span><span style="color: #00ffff; font-style: italic;">eQTL effects</span>
<span style="color: #0000ee;">logodds_w</span> = Normal(loc=tf.constant(-10.0), scale=tf.ones(1))
<span style="color: #0000ee;">scale_w</span> = Normal(loc=tf.zeros(1), scale=tf.ones(1))
<span style="color: #0000ee;">w</span> = SpikeSlab(logodds=logodds_w, loc=tf.zeros([p, m]), scale=scale_w)
<span style="color: #00ffff; font-style: italic;"># </span><span style="color: #00ffff; font-style: italic;">This is a dummy which gets swapped out in the inference</span>
<span style="color: #0000ee;">eta0</span> = LocalReparameterization(Normal(tf.matmul(x0, w), 1.0))
<span style="color: #0000ee;">g0</span> = NormalWithSoftplusScale(
    loc=eta0, scale=tf.Variable(tf.random_normal([1])))

<span style="color: #00ffff; font-style: italic;"># </span><span style="color: #00ffff; font-style: italic;">Mediated gene effects</span>
<span style="color: #0000ee;">logodds_v</span> = Normal(loc=tf.constant(-10.0), scale=tf.ones(1))
<span style="color: #0000ee;">scale_v</span> = Normal(loc=tf.zeros(1), scale=tf.ones(1))
<span style="color: #0000ee;">v</span> = SpikeSlab(logodds=logodds_v, loc=tf.zeros([m, 1]), scale=scale_v)
<span style="color: #0000ee;">eta1m</span> = LocalReparameterization(Normal(tf.matmul(tf.matmul(x1, w), v), 1.0))

<span style="color: #00ffff; font-style: italic;"># </span><span style="color: #00ffff; font-style: italic;">Unmediated effects</span>
<span style="color: #0000ee;">logodds_u</span> = Normal(loc=tf.constant(-10.0), scale=tf.ones(1))
<span style="color: #0000ee;">scale_u</span> = Normal(loc=tf.zeros(1), scale=tf.ones(1))
<span style="color: #0000ee;">u</span> = SpikeSlab(logodds=logodds_u, loc=tf.zeros([p, 1]), scale=scale_u)
<span style="color: #0000ee;">eta1u</span> = LocalReparameterization(Normal(tf.matmul(x1, u), 1.0))

<span style="color: #0000ee;">y1</span> = NormalWithSoftplusScale(loc=eta1m + eta1u, scale=tf.Variable(0.0))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orga28bc1b" class="outline-2">
<h2 id="orga28bc1b"><span class="section-number-2">4</span> Variational approximation</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre><code class="src src-python"><span style="color: #0000ee;">q_logodds_w</span> = Normal(loc=tf.Variable(tf.random_normal([1])),
                     scale=tf.Variable(tf.random_normal([1])))
<span style="color: #0000ee;">q_logodds_v</span> = Normal(loc=tf.Variable(tf.random_normal([1])),
                     scale=tf.Variable(tf.random_normal([1])))
<span style="color: #0000ee;">q_logodds_u</span> = Normal(loc=tf.Variable(tf.random_normal([1])),
                     scale=tf.Variable(tf.random_normal([1])))
<span style="color: #0000ee;">q_scale_w</span> = Normal(loc=tf.Variable(tf.random_normal([1])),
                   scale=tf.Variable(tf.random_normal([1])))
<span style="color: #0000ee;">q_scale_v</span> = Normal(loc=tf.Variable(tf.random_normal([1])),
                   scale=tf.Variable(tf.random_normal([1])))
<span style="color: #0000ee;">q_scale_u</span> = Normal(loc=tf.Variable(tf.random_normal([1])),
                   scale=tf.Variable(tf.random_normal([1])))

<span style="color: #00cd00;">import</span> scipy.linalg
initial_w, *<span style="color: #0000ee;">_</span> = scipy.linalg.lstsq(x_ref, g_ref)

<span style="color: #0000ee;">q_w</span> = SpikeSlab(logodds=tf.Variable(tf.zeros([p, m])),
                loc=tf.Variable(initial_w.astype(<span style="color: #00cdcd;">'float32'</span>)),
                scale=tf.Variable(tf.zeros([p, m])))
<span style="color: #0000ee;">q_eta0</span> = LocalReparameterization(
    Normal(loc=tf.matmul(x0, q_w.mean()),
           scale=tf.sqrt(tf.matmul(tf.square(x0), q_w.variance()))))
<span style="color: #0000ee;">q_v</span> = SpikeSlab(logodds=tf.Variable(tf.zeros([m, 1])),
                loc=tf.Variable(tf.random_normal([m, 1])),
                scale=tf.Variable(tf.zeros([m, 1])))
<span style="color: #00ffff; font-style: italic;"># </span><span style="color: #00ffff; font-style: italic;">Conviently keep the necessary mean and variance around</span>
<span style="color: #0000ee;">q_eta1</span> = Normal(loc=tf.matmul(x1, q_w.mean()),
                scale=tf.sqrt(tf.matmul(tf.square(x1), q_w.variance())))
<span style="color: #0000ee;">var</span> = (tf.reduce_sum(tf.square(q_eta1.mean()) *
                     tf.transpose(q_v.variance()), axis=1, keep_dims=<span style="color: #00cdcd;">True</span>) +
       tf.reduce_sum(tf.transpose(tf.square(q_v.mean())) *
                     q_eta1.variance(), axis=1, keep_dims=<span style="color: #00cdcd;">True</span>) +
       tf.matmul(q_eta1.variance(), q_v.variance()))
<span style="color: #0000ee;">q_eta1m</span> = LocalReparameterization(
    Normal(loc=tf.matmul(tf.matmul(x1, q_w.mean()), q_v.mean()),
           scale=tf.sqrt(var)))

<span style="color: #0000ee;">q_u</span> = SpikeSlab(logodds=tf.Variable(tf.zeros([p, 1])),
                loc=tf.Variable(tf.zeros([p, 1])),
                scale=tf.Variable(tf.zeros([p, 1])))
<span style="color: #0000ee;">q_eta1u</span> = LocalReparameterization(
    Normal(loc=tf.matmul(x1, q_u),
           scale=tf.sqrt(tf.matmul(tf.square(x1), q_u.variance()))))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org95dff5e" class="outline-2">
<h2 id="org95dff5e"><span class="section-number-2">5</span> Model fitting</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre><code class="src src-python"><span style="color: #0000ee;">inference</span> = ed.ReparameterizationKLKLqp(
    latent_vars={
        logodds_w: q_logodds_w,
        logodds_v: q_logodds_v,
        logodds_u: q_logodds_u,
        scale_w: q_scale_w,
        scale_v: q_scale_v,
        scale_u: q_scale_u,
        w: q_w,
        v: q_v,
        eta0: q_eta0,
        eta1m: q_eta1m,
        eta1u: q_eta1u,
    },
    data={
        x0: x_ref,
        g0: g_ref,
        x1: x_gwas,
        y1: y_gwas,
    })
inference.run(n_iter=2000, optimizer=<span style="color: #00cdcd;">'rmsprop'</span>)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgfe7120d" class="outline-2">
<h2 id="orgfe7120d"><span class="section-number-2">6</span> Model evaluation</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre><code class="src src-python"><span style="color: #00cd00;">import</span> matplotlib.gridspec
<span style="color: #00cd00;">import</span> matplotlib.pyplot <span style="color: #00cd00;">as</span> plt

<span style="color: #0000ee;">sess</span> = ed.get_session()
<span style="color: #0000ee;">est_w</span> = sess.run(q_w.pip)
<span style="color: #0000ee;">est_v</span> = sess.run(q_v.pip)
<span style="color: #0000ee;">est_u</span> = sess.run(q_u.pip)

plt.switch_backend(<span style="color: #00cdcd;">'pdf'</span>)
<span style="color: #0000ee;">gs</span> = matplotlib.gridspec.GridSpec(2, 2, width_ratios=[100, 1])
<span style="color: #0000ee;">norm</span> = matplotlib.colors.NoNorm(0, 1)
<span style="color: #0000ee;">fig</span> = plt.gcf()
fig.set_size_inches(8, 2)
plt.clf()
plt.subplot(gs[0])
plt.imshow(est_w.T, cmap=<span style="color: #00cdcd;">'Greys'</span>, norm=norm)
<span style="color: #0000ee;">ax</span> = plt.gca()
ax.set_xticks([])
ax.set_yticks([])
ax.set_xticklabels([])
ax.set_yticklabels([])
ax.set_xlabel(<span style="color: #00cdcd;">''</span>)
ax.set_ylabel(<span style="color: #00cdcd;">'Genes'</span>)

plt.subplot(gs[1])
plt.imshow(est_v, cmap=<span style="color: #00cdcd;">'Greys'</span>, norm=norm)
<span style="color: #0000ee;">ax</span> = plt.gca()
ax.set_xticks([])
ax.set_yticks([])
ax.set_xticklabels([])
ax.set_yticklabels([])

plt.subplot(gs[2])
plt.imshow(est_u.T, cmap=<span style="color: #00cdcd;">'Greys'</span>, norm=norm)
<span style="color: #0000ee;">ax</span> = plt.gca()
ax.set_xticks([])
ax.set_yticks([])
ax.set_xticklabels([])
ax.set_yticklabels([])
ax.set_xlabel(<span style="color: #00cdcd;">'Variants'</span>)

plt.savefig(<span style="color: #00cdcd;">'coefficients-unmediated'</span>)
plt.close()
</code></pre>
</div>

<p>
<a href="coefficients-unmediated.pdf">coefficients-unmediated.pdf</a>
</p>
</div>
</div>
<div id="outline-container-org958b2bb" class="outline-2">
<h2 id="org958b2bb"><span class="section-number-2">7</span> Conclusions</h2>
<div class="outline-text-2" id="text-7">
<p>
Including uncorrelated unmediated effects in the model doesn't affect
inference of mediated effects. This isn't surprising since in this case it's
valid to put them in the residual (following the GLM assumption that the
residual is uncorrelated with the predictors).
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abhishek Sarkar</p>
<p class="date">Created: 2017-10-04 Wed 19:26</p>
<p class="creator">Emacs 25.1.1 (Org mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
